In [1]:
import pandas as pd

In [10]:
data = {
    "custonerID": [101,102,103,104,105, None],
    "Name": ["meera","janabai", None , "tukaram","chokhamedha","chippa"],
    "amount": ["2500","1800", None, "2222",None,"abc"],
    "city":[ "mumbai", "pune", "delhi", None, "delhi","lucknow"]
}

In [11]:
df = pd.DataFrame(data)

In [12]:
print (df.head(5))

   custonerID         Name amount    city
0       101.0        meera   2500  mumbai
1       102.0      janabai   1800    pune
2       103.0         None   None   delhi
3       104.0      tukaram   2222    None
4       105.0  chokhamedha   None   delhi

In [17]:
#checking we have missing values

df.isnull().sum()

custonerID    1
Name          1
amount        2
city          1
dtype: int64

In [15]:
df.info() # checking the data type of our DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   custonerID  5 non-null      float64
 1   Name        5 non-null      object
 2   amount      4 non-null      object
 3   city        5 non-null      object
dtypes: float64(1), object(3)
memory usage: 324.0+ bytes

In [18]:
df.describe() #checking statistical summary

       custonerID
count    5.000000
mean   103.000000
std      1.581139
min    101.000000
25%    102.000000
50%    103.000000
75%    104.000000
max    105.000000

In [21]:
df.shape #checking shape of data

(6, 4)

In [25]:
#handling missing values

df["custonerID"]=df["custonerID"].fillna(df["custonerID"].mode())

In [26]:
df

   custonerID         Name amount     city
0       101.0        meera   2500   mumbai
1       102.0      janabai   1800     pune
2       103.0         None   None    delhi
3       104.0      tukaram   2222     None
4       105.0  chokhamedha   None    delhi
5       101.0       chippa    abc  lucknow

In [31]:
#if name of customer or city is missing
df["Name"] = df["Name"].fillna("Unknown")
df["city"] = df["city"].fillna("Unknown")
df["amount"] = df ["amount"].fillna("Unknown")
print(df)

   custonerID         Name   amount     city
0       101.0        Meera     2500   Mumbai
1       102.0      Janabai     1800     Pune
2       103.0      Unknown  Unknown    Delhi
3       104.0      Tukaram     2222  Unknown
4       105.0  Chokhamedha  Unknown    Delhi
5       101.0       Chippa      abc  Lucknow

In [32]:
#removing any extra spaces

df["Name"] = df["Name"].str.strip().str.title()
df["city"] = df["city"].str.strip().str.title()

In [33]:
df["amount"] = df["amount"].str.replace(" ","", regex = False ) #removing spaces from amount

In [34]:
df["amount"] = pd.to_numeric(df["amount"], errors="coerce")

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   custonerID  6 non-null      float64
 1   Name        6 non-null      object
 2   amount      3 non-null      float64
 3   city        6 non-null      object
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

In [36]:
df["amount"]= df["amount"].fillna(df["amount"].mean())

In [37]:
df

   custonerID         Name  amount     city
0       101.0        Meera  2500.0   Mumbai
1       102.0      Janabai  1800.0     Pune
2       103.0      Unknown  2174.0    Delhi
3       104.0      Tukaram  2222.0  Unknown
4       105.0  Chokhamedha  2174.0    Delhi
5       101.0       Chippa  2174.0  Lucknow

In [38]:
df.drop_duplicates(inplace= True)

In [39]:
df

   custonerID         Name  amount     city
0       101.0        Meera  2500.0   Mumbai
1       102.0      Janabai  1800.0     Pune
2       103.0      Unknown  2174.0    Delhi
3       104.0      Tukaram  2222.0  Unknown
4       105.0  Chokhamedha  2174.0    Delhi
5       101.0       Chippa  2174.0  Lucknow